package ru.avalon.java.j20.labs.tasks;

import ru.avalon.java.j20.labs.Task;

import java.io.IOException;
import java.util.Locale;
import java.util.ResourceBundle;

/**
 * Задание №5
 *
 * <p>Тема: "Потоковый ввод-вывод. Чтение локализованных ресурсов".
 */
public class Task5 implements Task {

    /**
     * {@inheritDoc}
     */
    @Override
    public void run() throws IOException {
        String path = "resources.strings.titles" ;
        Locale.setDefault(Locale.ENGLISH);   
        
       ResourceBundle bundle1 = read(path);
       ResourceBundle bundle2 = read(path, locale);
       
       String string1 = bundle1.getString("menu.edit");
       String string2 = bundle2.getString("menu.edit");
       
       System.out.println(string1.toString());
       System.out.println(string2.toString());
       /*
         * TODO(Студент): Выполнить задание №5
         *
         * 1. Реализовать метод read.
         *
         * 2. Прочитать ресурсы с использованием локализации по умолчанию.
         *
         * 3. Прочитать ресурсы с использованием локализации, отличной от той,
         *    которая задана по умолчанию.
         *
         * 4. С использованием отладчика сравнить полученные ресурсы и
         *    проверить корректность работы программы.
         */

       


       

       bundle = read("resources/strings/titles");
       System.out.println(bundle.getString(menuFile));
    }

    /**
     * Выполняет чтение локализованных ресурсов с использованием
     * локализации по умолчанию.
     *
     * @param path путь к файлу ресурсов
     * @return новый экземпляр типа {@link ResourceBundle}
     */
    private ResourceBundle read(String path) {
        ResourceBundle bundle = ResourceBundle.getBundle(path, locale);
        return bundle;
    }

    /**
     * Выполняет чтение локализованных ресурсов.
     *
     * @param path путь к файлу ресурсов
     * @return новый экземпляр типа {@link ResourceBundle}
     */
//    private ResourceBundle read(String path, Locale locale) {
//        throw new UnsupportedOperationException("Not implement yet!");
   
}
